[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:8:24
     type: 'Electric',
     averageWeight: {
       value: '6.0',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:10:12
       value: '6.0',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Pikachu_(Pok%C3%A9mon)',
     foundAt: [

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:13:7
     image: 'https://cdn.bulbagarden.net/upload/b/b2/Spr_5b_025_m.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Pikachu_(Pok%C3%A9mon)',
     foundAt: [
-      {
-        location: 'Kanto Viridian Forest',
-        map: 'https://cdn.bulbagarden.net/upload/0/08/Kanto_Route_2_Map.png',
-      },
+      {},
       {
         location: 'Kanto Power Plant',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:15:14
     foundAt: [
       {
         location: 'Kanto Viridian Forest',
-        map: 'https://cdn.bulbagarden.net/upload/0/08/Kanto_Route_2_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:22:14
         map: 'https://cdn.bulbagarden.net/upload/b/bd/Kanto_Celadon_City_Map.png',
       },
     ],
-    summary: 'This intelligent Pokémon roasts hard berries with electricity to make them tender enough to eat.',
+    summary: "",
   },
   {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:32:12
       value: '8.5',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/0/0a/Spr_5b_004.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Charmander_(Pok%C3%A9mon)',
     foundAt: [

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:39:7
         location: 'Alola Route 3',
         map: 'https://cdn.bulbagarden.net/upload/9/93/Alola_Route_3_Map.png',
       },
-      {
-        location: 'Kanto Route 3',
-        map: 'https://cdn.bulbagarden.net/upload/4/4a/Kanto_Route_3_Map.png',
-      },
+      {},
       {
         location: 'Kanto Route 4',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:40:19
         map: 'https://cdn.bulbagarden.net/upload/9/93/Alola_Route_3_Map.png',
       },
       {
-        location: 'Kanto Route 3',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/4/4a/Kanto_Route_3_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:44:19
         map: 'https://cdn.bulbagarden.net/upload/4/4a/Kanto_Route_3_Map.png',
       },
       {
-        location: 'Kanto Route 4',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/2/24/Kanto_Route_4_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:45:14
       },
       {
         location: 'Kanto Route 4',
-        map: 'https://cdn.bulbagarden.net/upload/2/24/Kanto_Route_4_Map.png',
+        map: "",
       },
       {

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:47:7
         location: 'Kanto Route 4',
         map: 'https://cdn.bulbagarden.net/upload/2/24/Kanto_Route_4_Map.png',
       },
-      {
-        location: 'Kanto Rock Tunnel',
-        map: 'https://cdn.bulbagarden.net/upload/6/6f/Kanto_Rock_Tunnel_Map.png',
-      },
+      {},
     ],
     summary: 'The flame on its tail shows the strength of its life force. If it is weak, the flame also burns weakly.',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:48:19
         map: 'https://cdn.bulbagarden.net/upload/2/24/Kanto_Route_4_Map.png',
       },
       {
-        location: 'Kanto Rock Tunnel',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/6/6f/Kanto_Rock_Tunnel_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:57:11
   {
     id: 10,
     name: 'Caterpie',
-    type: 'Bug',
+    type: "",
     averageWeight: {
       value: '2.9',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:66:19
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Caterpie_(Pok%C3%A9mon)',
     foundAt: [
       {
-        location: 'Johto Route 30',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/7/76/Johto_Route_30_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:67:14
     foundAt: [
       {
         location: 'Johto Route 30',
-        map: 'https://cdn.bulbagarden.net/upload/7/76/Johto_Route_30_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:71:14
       },
       {
         location: 'Johto Route 31',
-        map: 'https://cdn.bulbagarden.net/upload/2/2b/Johto_Route_31_Map.png',
+        map: "",
       },
       {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:82:14
         map: 'https://cdn.bulbagarden.net/upload/4/4e/Johto_National_Park_Map.png',
       },
     ],
-    summary: 'For protection, it releases a horrible stench from the antennae on its head to drive away enemies.',
+    summary: "",
   },
   {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:86:11
   },
   {
     id: 23,
-    name: 'Ekans',
+    name: "",
     type: 'Poison',
     averageWeight: {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:96:19
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Ekans_(Pok%C3%A9mon)',
     foundAt: [
       {
-        location: 'Goldenrod Game Corner',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/e/ec/Johto_Goldenrod_City_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:105:11
   {
     id: 65,
     name: 'Alakazam',
-    type: 'Psychic',
+    type: "",
     averageWeight: {
       value: '48.0',

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:106:20
     id: 65,
     name: 'Alakazam',
     type: 'Psychic',
-    averageWeight: {
-      value: '48.0',
-      measurementUnit: 'kg',
-    },
+    averageWeight: {},
     image: 'https://cdn.bulbagarden.net/upload/8/88/Spr_5b_065_m.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Alakazam_(Pok%C3%A9mon)',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:110:12
       value: '48.0',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/8/88/Spr_5b_065_m.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Alakazam_(Pok%C3%A9mon)',
     foundAt: [

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:113:7
     image: 'https://cdn.bulbagarden.net/upload/8/88/Spr_5b_065_m.png',
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Alakazam_(Pok%C3%A9mon)',
     foundAt: [
-      {
-        location: 'Unova Accumula Town',
-        map: 'https://cdn.bulbagarden.net/upload/4/44/Unova_Accumula_Town_Map.png',
-      },
+      {},
     ],
     summary: 'Closing both its eyes heightens all its other senses. This enables it to use its abilities to their extremes.',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:123:11
   {
     id: 151,
     name: 'Mew',
-    type: 'Psychic',
+    type: "",
     averageWeight: {
       value: '4.0',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:126:24
     type: 'Psychic',
     averageWeight: {
       value: '4.0',
-      measurementUnit: 'kg',
+      measurementUnit: "",
     },
     image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:129:15
       measurementUnit: 'kg',
     },
     image: 'https://cdn.bulbagarden.net/upload/4/43/Spr_5b_151.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Mew_(Pok%C3%A9mon)',
+    moreInfo: "",
     foundAt: [
       {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:146:12
       value: '95.0',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',
     foundAt: [

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:147:15
       measurementUnit: 'kg',
     },
     image: 'https://cdn.bulbagarden.net/upload/5/58/Spr_5b_078.png',
-    moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Rapidash_(Pok%C3%A9mon)',
+    moreInfo: "",
     foundAt: [
       {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:154:19
         map: 'https://cdn.bulbagarden.net/upload/5/5b/Kanto_Route_28_Map.png',
       },
       {
-        location: 'Johto Mount Silver',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/9/95/Johto_Mt_Silver_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:162:11
   },
   {
     id: 143,
-    name: 'Snorlax',
+    name: "",
     type: 'Normal',
     averageWeight: {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:163:11
   {
     id: 143,
     name: 'Snorlax',
-    type: 'Normal',
+    type: "",
     averageWeight: {
       value: '460.0',

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:168:12
       value: '460.0',
       measurementUnit: 'kg',
     },
-    image: 'https://cdn.bulbagarden.net/upload/4/40/Spr_5b_143.png',
+    image: "",
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Snorlax_(Pok%C3%A9mon)',
     foundAt: [

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:172:19
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Snorlax_(Pok%C3%A9mon)',
     foundAt: [
       {
-        location: 'Kanto Vermillion City',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/5/54/Kanto_Vermilion_City_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:176:14
         map: 'https://cdn.bulbagarden.net/upload/5/54/Kanto_Vermilion_City_Map.png',
       },
     ],
-    summary: 'What sounds like its cry may actually be its snores or the rumblings of its hungry belly.',
+    summary: "",
   },
   {

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:190:19
     moreInfo: 'https://bulbapedia.bulbagarden.net/wiki/Dragonair_(Pok%C3%A9mon)',
     foundAt: [
       {
-        location: 'Johto Route 45',
+        location: "",
         map: 'https://cdn.bulbagarden.net/upload/2/21/Johto_Route_45_Map.png',
       },

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:195:14
       },
       {
         location: 'Johto Dragon\'s Den',
-        map: 'https://cdn.bulbagarden.net/upload/1/1e/Johto_Dragons_Den_Map.png',
+        map: "",
       },
     ],

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/data.js:198:14
         map: 'https://cdn.bulbagarden.net/upload/1/1e/Johto_Dragons_Den_Map.png',
       },
     ],
-    summary: 'They say that if it emits an aura from its whole body, the weather will begin to change instantly.',
+    summary: "",
   },
 ];
