[Survived] EqualityOperator
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
+  window.location.hostname !== 'localhost' ||
     // [::1] is the IPv6 localhost address.
     window.location.hostname === '[::1]' ||

[Survived] ConditionalExpression
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (true) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] ConditionalExpression
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:24:7
 );
 
 export function register(config) {
-  if (process.env.NODE_ENV === 'production' && 'serviceWorker' in navigator) {
+  if (true && 'serviceWorker' in navigator) {
     // The URL constructor is available in all browsers that support SW.
     const publicUrl = new URL(process.env.PUBLIC_URL, window.location.href);

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:34:29
       return;
     }
 
-    window.addEventListener('load', () => {
+    window.addEventListener("", () => {
       const swUrl = `${process.env.PUBLIC_URL}/service-worker.js`;
 

[Survived] StringLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:73:17
               // but the previous service worker will still serve the older
               // content until all client tabs are closed.
               console.log(
-                'New content is available and will be used when all ' +
+                "" +
                   'tabs for this page are closed. See https://bit.ly/CRA-PWA.'
               );

[Survived] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/serviceWorker.js:103:16
 
 function checkValidServiceWorker(swUrl, config) {
   // Check if the service worker can be found. If it can't reload the page.
-  fetch(swUrl, {
-    headers: { 'Service-Worker': 'script' }
-  })
+  fetch(swUrl, {})
     .then(response => {
       // Ensure service worker exists, and that we really are getting a JS file.
