[Killed] BlockStatement
PROJETO_RTL/sd-06-project-react-testing-library/src/renderWithRouter.js:6:41
 import { createMemoryHistory } from 'history';
 import { render } from '@testing-library/react';
 
-const renderWithRouter = (component) => {
-  const history = createMemoryHistory();
-  return {
-    ...render(<Router history={ history }>{component}</Router>), history,
-  };
-};
+const renderWithRouter = (component) => {};
 
 export default renderWithRouter;

[Killed] ObjectLiteral
PROJETO_RTL/sd-06-project-react-testing-library/src/renderWithRouter.js:8:10
 
 const renderWithRouter = (component) => {
   const history = createMemoryHistory();
-  return {
-    ...render(<Router history={ history }>{component}</Router>), history,
-  };
+  return {};
 };
 
